<template>
    <section class="tariffs">
        <div class="container">
            <h2 class="section__title">Простая, прозрачная оплата</h2>
            <p>Low Pulse располагает серией планов, подходящих именно для вас.</p>

            <div class="tariffs__switch"> 
                <input type="checkbox" id="tariffs__checkbox" class="checkbox">
                <div class="toggle"></div>              
                <div class="names">
                    <span>Ежемесячно</span>
                    <span>Ежегодно</span>
                </div>
                <label for="tariffs__checkbox" class="checkbox__label"></label>              
            </div>

            <div class="cards">
                <div class="card">
                    <h3 class="card__title">Не бизнес план</h3>
                    <h4 class="card__price"><span>200₽</span>/месяц</h4>
                    <span class="description">Оплата в месяц при оплате за год</span>
                    <ul class="include__list">
                        <li class="include">Нет ограничений на проекты</li>
                        <li class="include">Автоматические уведомления</li>
                        <li class="include">Нет ограничений на домены</li>
                        <li class="include">+5 одновременных пользователей</li>
                        <li class="include">+5 одновременных пользователей</li>
                    </ul>

                    <button class="btn">Оформить подписку</button>
                </div>
                <div class="card">
                    <div class="best-choise-bage">
                        <svg width="82" height="82" viewBox="0 0 82 82" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path opacity="0.5" d="M23.9622 16.3978C26.0238 12.3534 30.7169 10.4043 35.0372 11.7984L37.6673 12.6471C39.5186 13.2445 41.5112 13.2426 43.3614 12.6418L45.9899 11.7882C50.3076 10.3861 55.0043 12.3265 57.0734 16.3672L58.3331 18.827C59.2197 20.5585 60.63 21.9662 62.3632 22.8497L64.8254 24.1047C68.8698 26.1663 70.8189 30.8595 69.4248 35.1797L68.5761 37.8098C67.9787 39.6612 67.9806 41.6538 68.5814 43.504L69.435 46.1325C70.8371 50.4501 68.8967 55.1469 64.8561 57.216L62.3962 58.4756C60.6647 59.3623 59.257 60.7726 58.3735 62.5057L57.1185 64.9679C55.0569 69.0124 50.3637 70.9615 46.0435 69.5674L43.4134 68.7187C41.562 68.1213 39.5694 68.1231 37.7192 68.724L35.0907 69.5775C30.7731 70.9796 26.0763 69.0393 24.0072 64.9986L22.7476 62.5387C21.8609 60.8072 20.4506 59.3996 18.7175 58.5161L16.2553 57.261C12.2108 55.1994 10.2617 50.5063 11.6558 46.186L12.5045 43.5559C13.1019 41.7046 13.1001 39.712 12.4992 37.8618L11.6457 35.2333C10.2436 30.9156 12.1839 26.2189 16.2246 24.1498L18.6845 22.8901C20.416 22.0035 21.8236 20.5932 22.7071 18.8601L23.9622 16.3978Z" fill="#FC4141"/>
                        <path d="M26.2021 39H24.9238V32.3989H23.0547C22.7933 34.2573 22.5874 35.5715 22.437 36.3413C22.2866 37.1076 22.1344 37.6733 21.9805 38.0386C21.8265 38.4002 21.617 38.6706 21.3521 38.8496C21.0871 39.0251 20.7702 39.1128 20.4014 39.1128C20.0863 39.1128 19.8123 39.0716 19.5796 38.9893V37.8989C19.7515 37.9884 19.943 38.0332 20.1543 38.0332C20.3727 38.0332 20.5768 37.9061 20.7666 37.6519C20.9564 37.3976 21.1497 36.737 21.3467 35.6699C21.5472 34.5993 21.7674 33.1419 22.0073 31.2979H26.2021V39ZM32.7441 33.5L30.2627 39.8809C29.7471 41.0195 29.0238 41.5889 28.0928 41.5889C27.8314 41.5889 27.613 41.5656 27.4375 41.519V40.4824C27.6344 40.5469 27.8135 40.5791 27.9746 40.5791C28.4401 40.5791 28.7874 40.3499 29.0166 39.8916L29.3872 38.9893L27.2012 33.5H28.5815L29.8921 37.4961C29.9064 37.5462 29.9386 37.6787 29.9888 37.8936H30.0156C30.0335 37.8112 30.0658 37.6823 30.1123 37.5068L31.4873 33.5H32.7441ZM38.3408 39H37.0947V36.9268C36.4681 37.2669 35.8916 37.437 35.3652 37.437C34.1263 37.437 33.5068 36.7638 33.5068 35.4175V33.5H34.7261V35.2456C34.7261 36.0226 35.0304 36.4111 35.6392 36.4111C36.0903 36.4111 36.5755 36.2769 37.0947 36.0083V33.5H38.3408V39ZM47.4502 39H39.9683V33.5H41.2197V38.0493H43.0835V33.5H44.335V38.0493H46.1987V33.5H47.4502V39ZM54.0728 39H52.9448V34.9663C52.8732 35.1095 52.764 35.3083 52.6172 35.5625L50.3022 39H49.0776V33.5H50.2217V37.4531C50.2611 37.36 50.3452 37.1989 50.4741 36.9697L52.8213 33.5H54.0728V39ZM60.7007 39H59.5728V34.9663C59.5011 35.1095 59.3919 35.3083 59.2451 35.5625L56.9302 39H55.7056V33.5H56.8496V37.4531C56.889 37.36 56.9731 37.1989 57.1021 36.9697L59.4492 33.5H60.7007V39ZM60.3408 30.8521C60.2835 31.3892 60.0615 31.8135 59.6748 32.125C59.2917 32.4329 58.8101 32.5869 58.23 32.5869C57.6356 32.5869 57.1504 32.4329 56.7744 32.125C56.402 31.8135 56.1979 31.3892 56.1621 30.8521H57.1987C57.2489 31.5037 57.598 31.8296 58.2461 31.8296C58.5326 31.8296 58.7689 31.7437 58.9551 31.5718C59.1449 31.3999 59.2612 31.16 59.3042 30.8521H60.3408ZM24.2471 52V46.5H26.8735C27.4644 46.5 27.9316 46.62 28.2754 46.8599C28.6191 47.0998 28.791 47.4274 28.791 47.8428C28.791 48.5446 28.4312 48.9707 27.7114 49.1211C28.5672 49.2285 28.9951 49.651 28.9951 50.3887C28.9951 50.8434 28.8143 51.2266 28.4526 51.5381C28.091 51.846 27.6416 52 27.1045 52H24.2471ZM25.4932 47.3809V48.7505H26.5942C27.2173 48.7505 27.5288 48.5088 27.5288 48.0254C27.5288 47.5957 27.2567 47.3809 26.7124 47.3809H25.4932ZM25.4932 49.6152V51.1138H26.7715C27.4089 51.1138 27.7275 50.856 27.7275 50.3403C27.7275 49.8569 27.382 49.6152 26.6909 49.6152H25.4932ZM37.0249 52H35.7788V46.5H37.0249V52ZM30.3271 52V46.5H31.5732V48.5303H33.0771C33.6465 48.5303 34.0994 48.6807 34.436 48.9814C34.7726 49.2786 34.9409 49.694 34.9409 50.2275C34.9409 50.7754 34.7655 51.2087 34.4146 51.5273C34.0672 51.8424 33.6286 52 33.0986 52H30.3271ZM31.5732 49.4272V51.103H32.7119C33.3421 51.103 33.6572 50.8148 33.6572 50.2383C33.6572 49.6976 33.3385 49.4272 32.7012 49.4272H31.5732ZM43.1802 43.7661V44.8242C43.0369 44.9209 42.806 44.9925 42.4873 45.0391C41.6995 45.1501 41.1481 45.2575 40.833 45.3613C40.5215 45.4616 40.2655 45.6782 40.0649 46.0112C39.8644 46.3407 39.7355 46.8241 39.6782 47.4614H39.6997C40.1079 46.91 40.6916 46.6343 41.4507 46.6343C42.1847 46.6343 42.7756 46.8796 43.2231 47.3701C43.6707 47.8571 43.8945 48.5016 43.8945 49.3037C43.8945 50.1559 43.6457 50.8398 43.1479 51.3555C42.6538 51.8711 41.986 52.1289 41.1445 52.1289C40.2565 52.1289 39.5726 51.8263 39.0928 51.2212C38.6165 50.616 38.3784 49.7513 38.3784 48.627C38.3784 47.7604 38.4661 47.0264 38.6416 46.4248C38.8171 45.8232 39.0605 45.3703 39.3721 45.0659C39.6836 44.7616 40.0291 44.5521 40.4087 44.4375C40.7882 44.3229 41.4399 44.1886 42.3638 44.0347C42.729 43.9559 43.0011 43.8664 43.1802 43.7661ZM39.6621 48.4766V49.1641C39.6657 49.4183 39.7033 49.6707 39.7749 49.9214C39.8465 50.1685 39.9486 50.3869 40.0811 50.5767C40.2135 50.7664 40.3711 50.9079 40.5537 51.001C40.7363 51.0941 40.944 51.1406 41.1768 51.1406C41.6064 51.1406 41.9538 50.9777 42.2188 50.6519C42.4873 50.3224 42.6216 49.9017 42.6216 49.3896C42.6216 48.8418 42.4855 48.4067 42.2134 48.0845C41.9448 47.7586 41.5796 47.5957 41.1177 47.5957C40.4731 47.5957 39.988 47.8893 39.6621 48.4766ZM47.6113 52.1289C46.7627 52.1289 46.0841 51.8729 45.5757 51.3608C45.0708 50.8452 44.8184 50.1631 44.8184 49.3145C44.8184 48.3906 45.0815 47.6691 45.6079 47.1499C46.1379 46.6307 46.8504 46.3711 47.7456 46.3711C48.605 46.3711 49.2746 46.6235 49.7544 47.1284C50.2342 47.6333 50.4741 48.3333 50.4741 49.2285C50.4741 50.1058 50.2145 50.8094 49.6953 51.3394C49.1797 51.8657 48.485 52.1289 47.6113 52.1289ZM47.6704 47.3647C47.1834 47.3647 46.7985 47.5348 46.5156 47.875C46.2327 48.2152 46.0913 48.6842 46.0913 49.2822C46.0913 49.8587 46.2345 50.3135 46.521 50.6465C46.8075 50.9759 47.1906 51.1406 47.6704 51.1406C48.161 51.1406 48.5369 50.9777 48.7983 50.6519C49.0633 50.326 49.1958 49.8623 49.1958 49.2607C49.1958 48.6556 49.0633 48.1883 48.7983 47.8589C48.5369 47.5295 48.161 47.3647 47.6704 47.3647ZM53.0146 51.189H52.9932V54.5298H51.7471V46.5H52.9932V47.4668H53.0146C53.4408 46.7363 54.0638 46.3711 54.8838 46.3711C55.582 46.3711 56.1263 46.6164 56.5166 47.1069C56.9069 47.5975 57.1021 48.2563 57.1021 49.0835C57.1021 50.0002 56.8818 50.7342 56.4414 51.2856C56.001 51.8371 55.3994 52.1128 54.6367 52.1128C53.9349 52.1128 53.3942 51.8049 53.0146 51.189ZM52.9824 49.019V49.7012C52.9824 50.1022 53.1095 50.4424 53.3638 50.7217C53.6216 51.001 53.9474 51.1406 54.3413 51.1406C54.8032 51.1406 55.1649 50.9616 55.4263 50.6035C55.6912 50.2419 55.8237 49.7388 55.8237 49.0942C55.8237 48.5535 55.7002 48.131 55.4531 47.8267C55.2096 47.5187 54.8784 47.3647 54.4595 47.3647C54.0155 47.3647 53.6574 47.5223 53.3853 47.8374C53.1167 48.1525 52.9824 48.5464 52.9824 49.019Z" fill="white"/>
                        </svg>
                    </div>
                    <h3 class="card__title">Бизнес план</h3>
                    <h4 class="card__price"><span>400₽</span>/месяц</h4>
                    <span class="description">Оплата в месяц при оплате за год</span>
                    <ul class="include__list">
                        <li class="include">Нет ограничений на проекты</li>
                        <li class="include">Автоматические уведомления</li>
                        <li class="include">Нет ограничений на домены</li>
                        <li class="include">+5 одновременных пользователей</li>
                        <li class="include">+5 одновременных пользователей</li>
                    </ul>

                    <button class="btn btn_white">Оформить подписку</button>
                </div>
                <div class="card">
                    <h3 class="card__title">Не бизнес план</h3>
                    <h4 class="card__price"><span>200₽</span>/месяц</h4>
                    <span class="description">Оплата в месяц при оплате за год</span>
                    <ul class="include__list">
                        <li class="include">Нет ограничений на проекты</li>
                        <li class="include">Автоматические уведомления</li>
                        <li class="include">Нет ограничений на домены</li>
                        <li class="include">+5 одновременных пользователей</li>
                        <li class="include">+5 одновременных пользователей</li>
                    </ul>

                    <button class="btn">Оформить подписку</button>
                </div>
            </div>
        </div>
    </section>
</template>
<style lang="scss" scoped>
.tariffs {    
    height: auto;
    min-height: 720px;
    background: var(--blue) url('../../assets/img/main-bg.png') no-repeat;
    background-size: cover;
    border-radius: 40px 50px 0 0 ;
    overflow: hidden; 
    position: relative;
    padding: 120px 0;

    &::before {
        content: '';
        position: absolute;
        top: 110px;
        left: 0;
        right: 0;
        background: url('../../assets/img/graph.svg') no-repeat;
        background-size: cover;
        height: 100%;
        pointer-events: none;
    }
    &::after {
        content: '';
        position: absolute;
        bottom: 5px;
        left: 0;
        right: 0;
        background: url('../../assets/img/puls-line.svg') no-repeat;
        background-position: -166px;
        background-size: cover;
        height: 80px;
    }

    p {
        color: var(--white);
        font-size: clamp(16px, 4vw, 20px);
        margin-bottom: 30px;
        text-align: center;
    }
}

.section__title {
    color: var(--white);
    margin-bottom: 32px;
}

.tariffs__switch {
    margin: 0 auto;
    width: 340px;
    background: #E8F8F3;
    border: 1px solid #B8B8B8;
    border-radius: 30px;
    padding: 5px 6px;    
    gap: 9px;
    position: relative;
    margin-bottom: 30px;
}

.names {
    display: grid;
    grid-template-columns: 1fr 1fr;
    gap: 9px;
    font-size: 13px;
    font-weight: 600;
    color: #828282;
    
    span {
        display: block;
        padding: 9px;
        cursor: pointer;
        text-align: center;
        position: relative;
        z-index: 1;
    }
}

.toggle {
    position: absolute;
    border: 1px solid #B8B8B8;
    border-radius: 30px;
    background: var(--white);
    width: calc(50% - 10px);
    height: calc(100% - 10px);
    left: 6px;
    top: 5px;
    z-index: 0;
    transition: transform .3s;
}

.checkbox {
    display: none;
   
    &:checked + .toggle{
       transform: translateX(calc(100% + 9px));
    }
    &:checked + .names{
        span:nth-child(1){
            color: var(--blue);

        }
    }
}

.checkbox__label {
    position: absolute;
    width: 100%;
    height: 100%;
    top: 0;
    left: 0;
    right: 0;
    bottom: 0;  
    z-index: 2;
    cursor: pointer;
}

.cards {
    display: grid;
    grid-template-columns: 1fr 1fr 1fr;
    gap: 20px;
    align-items: center;
}

.card {
    padding: 38px 40px;
    border: 1px solid var(--border);
    border-radius: 10px;
    background: var(--white);
    position: relative;
    color: var(--blue);

    &:nth-child(2) {
        padding: 60px 40px;
        color: var(--white);
        background: var(--blue) url('../../assets/img/main-bg.png') no-repeat;
        background-size: cover;
        border-color: rgba(20, 86, 255, .5);
        background-position: right top;
    }

    .btn {
        max-width: 100%;
        padding: 15px;
    }
}

.card__title {
    font-size: 24px;
    font-weight: 700;
    margin-bottom: 51px;
    text-align: center;
}
.card__price {
    font-size: 24px;
    font-weight: 700;
    text-align: center;
    margin-bottom: 25px;
    display: block;

    span {
        font-size: 54px;
        font-weight: 600;
        font-family: 'Jost', sans-serif;
    }
}

.description {
    text-align: center;
    display: block;
    margin-bottom: 34px;
}

.include__list {
    display: flex;
    flex-direction: column;
    gap: 20px;
    margin-bottom: 40px;
}

.include {
    position: relative;
    padding-left: 32px;

    &::before {
        content: '';
        position: absolute;
        width: 16px;
        height: 12px;
        left: 0;
        top: 0;
        background: url('../../assets/img/checked.svg');
    }
}
.best-choise-bage {
    position: absolute;
    right: 0;
    top: 0;
}

@media (max-width: 1100px) {
    .cards {
        grid-template-columns: 1fr;
        gap: 30px;
    }
}

@media (max-width: 500px) {
    .tariffs {
        padding: 60px 0;

        &::after {
            height: 40px;
        }
    }

    .section__title {
        margin-bottom: 17px;
    }

    .tariffs__switch {
        width: 100%;
        margin-bottom: 64px;
    }

    .card {
        padding: 28px 14px 18px 14px;

        .btn {
            padding: 12px;
        }

        &:nth-child(2) {
            padding: 57px 14px 50px 14px;
        }
    }
    .include__list {
        margin-bottom: 23px;
    }
}
</style>